From WBEZ Chicago, it's This American Life, distributed by Public Radio International. I'm Ira Glass. And I'm coming to you today to say something that I've never had to say on our program. Two months ago, we broadcast a story that we've come to believe is not true. It's a story that got a lot of attention. More people downloaded it than any episode we have ever done.

This is Mike Daisey's story about visiting a plant in China where Apple manufactures iPhones, and iPads, and other products. He's been performing this story on stage as a monologue since 2010. We didn't commission this story. We didn't send him to China. We excerpted the stage show that he's been telling in theaters around the country.

We did fact-check the story before we put it on the radio. But in fact-checking, our main concern was whether the things that Mike says about Apple and about its supplier, Foxconn, which makes this stuff, were true. That stuff is true. It's been corroborated by independent investigations by other journalists and studies by advocacy groups. And much of it has been corroborated by Apple itself in its own audit reports.

But what's not true is what Mike said about his own trip to China. As best as we can tell, Mike's monologue in reality is a mix of things that actually happened when he visited China and things that he had just heard about or researched, which he then pretends that he witnessed firsthand. He pretends that he just stumbled upon an array of workers who typify all kinds of harsh things that somebody might face in a factory that makes iPhones and iPads. And the most powerful and memorable moments in the story all seem to be fabricated.

At the time that we were fact-checking his story, we asked Mike for the contact information for the interpreter that he used when he was visiting China, who he calls Cathy in his monologue. We wanted to talk to her to confirm that the incidents that he described all happened as he describes them. And when we asked for her information, he told us, well, her real name wasn't Cathy. It was Anna.

And he had a cell phone number for her, but he said that when he tried the number these days, it doesn't work anymore. He said he had no way to reach her. And because the other things that Mike told us about Apple and about Foxconn seemed to check out, we saw no reason to doubt him, and we dropped this. We didn't try further to reach the translator. That was a mistake.

I can say now in retrospect that when Mike Daisey wouldn't give us contact information for his interpreter, we should have killed the story rather than run it. We never should have broadcast this story without talking to that woman. Instead, we trusted his word. Although he's not a journalist, we made clear to him that anything that he was going to say on our program would have to live up to journalistic standards. He had to be truthful. And he lied to us.

All this came to our attention because the China correspondent for the public radio show Marketplace, Rob Schmitz, who lives in Shanghai, heard the story and had questions about it, had suspicions about it. And he went out, and he found the translator. And although Mike told us that her name is really Anna, Mike now admits to keep us from finding her, her name it actually is Cathy, just like he says in the monologue. Rob ran the details of Mike's monologue by Cathy and learned that much of the story is not factual. Cathy gave Rob emails between her and Mike that corroborated her version of some of the events.

Today on our radio program, we're going to hear what she said to Rob. And then we're going to talk to Mike Daisey about why he lied to all of you and to me off the air during the fact-checking process. And we're going to end our show with somebody who actually knows the facts of what happens in Apple's suppliers in China, who's going to review those for us.

I should say I am not happy to have to come to you and tell you that something that we presented on the radio as factual is not factual. All of us in public radio stand together. And I have friends and colleagues on lots of other shows who, like us here at This American Life, work hard to do accurate, independent reporting week in, week out. I and my co-workers here at This American Life, we are not happy to have done anything to hurt the reputation of the journalism that happens on this radio station every day. So we want to be completely transparent about what we got wrong and what we now believe is the truth.

And let's just get to it. Here's Rob Schmitz, who usually reports for Marketplace, in Shanghai.