Today we will talk about a special character during civil war. During the civil war, both the federal army and the confederacy employed thousands of surgeons and assistant surgeons. All of these surgeons had the rank of officers equivalent to a major or a captain. So, not surprisingly at the time, most of these surgeons were men. In fact, there were only a handful of women in US who had received medical degrees from US institutions and the most they were allowed to do was to work as a nurse or as a volunteer.

Dr Mary Edwards Walker was the exception. She was the only woman surgeon who was formerly engaged in field duty during the war. She worked for the union side, and also won a medal of honor.

Mary Edwards Walker was born on November 6th 1832. She was the fifth daughter of her parents, Alvah and Vesta. They really encouraged their children to pursue education, and also started a local school.

As a young woman, she enrolled in Syracuse Medical College. She graduated with honors in 1855, and she was the only woman in her class.

After graduation, she tried to set up practice in Columbus, Ohio, but it was not successful. She set up another practice in Rome, New York, but that also did not flourish.

When the war broke out, Walker wanted to help out the union cause. She thought that the army would be in need of skilled surgeons, and that they might take a woman doctor. The army turned her down. However, Walker stayed on in Washington and worked as a volunteer nurse. She worked in the battlefield in Warrenton and Fredericksburg, Virginia. She was allowed to treat soldiers but she was not paid.

She continued to lobby for an appointment in the army. Eventually, she made a name for herself. At the end of 1863 received an appointment as a contracted surgeon. Since this was a civilian position, she had to go through a medical competency exam. The exam did not go well. One of the examination board members described her as a “medical monstrosity dressed in a hybrid costume, who had no more medical knowledge than an ordinary housewife.” Walker thought she was not fairly treated. She said it was intended to be a farce which had no relation to disease and wounds of soldiers. 

Regardless, she got to keep her post and join the 52nd Ohio regiment. Her contract paid eighty dollars a month. During her service, she frequently crossed battle lines, and treated civilians as well as soldiers.

On April 10th, 1864 confederate soldiers captured her as a spy. She was sent to Richmond Virginia as a prisoner and remained there until August 12th, until she was released as part of a prisoner exchange.
After the war, she worked as a writer and lecturer, supporting such issues as health care, temperance and dress reform for women. She also continued to take appointments from the military, but they were more administrative than surgical. She never had the full career she wanted in the army. 

However, the year she left the army, in 1865, she was awarded the medal of honor by president Andrew Johnson for “rendering valuable service to the government to the detriment of her own health.” She was the first and is still the only woman who won the medal of honor. 

In 1917, her medal of honor was revoked with about 900 other people, by the board of medal awards because she hadn’t actually seen combat. She continued to wear her medal until she died. In 1977, president Jimmy Carter restored her medal of honor. 

The New York Times wrote about Dr Mary Edwards Walker. Here is what they wrote. Few people have ridiculed Dr Mary to her face. Perhaps it was because she had a sort of dignity because about her essential goodness there has never been any question. 


